{
  "categories": {
    "bilim": [
      {
        "details": {
          "part_eight_text": "",
          "part_five_text": "In the end, Alex successfully brings Sarah back from the virtual world and exposes the dangers of this technology. People return from virtual reality and resume their lives in the real world. Through this journey, Alex not only wins his internal battle but also achieves a significant victory for humanity.",
          "part_four_text": "Alex learns about the existence of a company that controls the virtual world and manipulates people. This company traps people in the virtual world by controlling their minds. Alex fights to save Sarah and to stop this dark company.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b1.1.svg?alt=media&token=d16aa103-45a0-4a69-af0b-c3e38ad55c16",
          "part_one_text": "In the near future, a technology is developed that allows people to live their lives in virtual reality. This technology enables individuals to completely disconnect from the physical world and live in the worlds they imagine. In these virtual worlds, people can do whatever they want, fulfill their dreams, and experience their deepest desires.",
          "part_seven_text": "",
          "part_six_text": "",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b1.3.svg?alt=media&token=8921aacf-ed54-41c8-87c5-5799857b6acf",
          "part_three_text": "One day, Alex's close friend and colleague, Sarah, gets lost in the virtual world and cannot return. Sarah's disappearance deeply affects Alex, driving him to uncover the dark side of this technology. To rescue Sarah, Alex enters the virtual world and discovers the great secrets and dangers behind the technology.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b1.2.svg?alt=media&token=03e98244-f0aa-4a37-9167-4bdd9bb2497b",
          "part_two_text": "Alex, an engineer working at a tech company, is part of the team that developed this virtual reality technology. However, the freedom and happiness brought by the technology gradually turn into addiction, causing people to detach from the real world. Alex begins to question the ethical and moral implications of this situation.",
          "title": "Virtual Lives"
        },
        "id": 0,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b1.1.svg?alt=media&token=d16aa103-45a0-4a69-af0b-c3e38ad55c16",
        "title": "Virtual Lives"
      },
      {
        "details": {
          "part_eight_text": "",
          "part_five_text": "At the end of the mission, Nathan begins to question the ethical and moral implications of this technology. He decides to abandon the dream hunting business and cease his work on the technology, choosing instead to seek a more ethical and humane path.",
          "part_four_text": "Eventually, Nathan reaches the deepest fears and traumas of the businessman's mind. During this process, he also confronts the dark secrets of his own subconscious. The team, overcoming significant challenges and dangers, completes the mission and plants the desired idea in the businessman's mind.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b2.1.svg?alt=media&token=22e95c05-b1f4-423a-9274-3ac9d81092c5",
          "part_one_text": "Nathan, a brilliant scientist, has developed a technology that can create dreams within dreams. This technology allows people to enter the subconscious mind, manipulate dreams, and steal information. Nathan and his team use this technology to carry out covert missions for major corporations.",
          "part_seven_text": "",
          "part_six_text": "",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b2.3.svg?alt=media&token=4bc8534f-6623-4ad7-9613-8ba3df9093cb",
          "part_three_text": "Nathan and his team journey through layers of dreams to complete this perilous mission. However, at each level, they encounter greater dangers and unexpected enemies. In the depths of the mind, the boundaries between reality and illusion blur, and the team finds themselves in a constantly repeating maze.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b2.2.svg?alt=media&token=41fdb49b-d52b-41f8-bd6f-402b1ca8dece",
          "part_two_text": "One day, Nathan is offered a very challenging assignment: to enter the mind of a businessman and implant an idea that will lead him to bankruptcy. This task is much more dangerous and complex than usual because the businessman's mind is consciously protected.",
          "title": "Dream Hunters"
        },
        "id": 1,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b2.1.svg?alt=media&token=22e95c05-b1f4-423a-9274-3ac9d81092c5",
        "title": "Dream Hunters"
      },
      {
        "details": {
          "part_eight_text": "In the end, Sophie and James succeeded in setting up a rain filtration system that prevented the virus from spreading again, and they set out with hope to rebuild the world. The hardships they endured and the experiences they gained made them stronger. ",
          "part_five_text": "Sophie and James discovered that their father had developed the virus and designed it to spread through rain. This information was both painful and a powerful motivation. The siblings uncovered their father's role in the disaster and the secrets of their family's past.",
          "part_four_text": "On their journey, they encountered a surviving group called \"The Resistance.\" This group was working to fight the virus and restore the old order. Sophie and James met the group’s members and learned important information about their father’s projects. These new friends gave them hope and assisted them in their efforts to stop the virus.",
          "part_nine_text": " They continued their struggle to create a better future with a new beginning and enjoyed getting drenched in the rain, ready for the new world they were helping to build.",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b3.1.svg?alt=media&token=11a5a0d4-3de0-4474-a66f-100c9c991df0",
          "part_one_text": "A virus has taken hold of Denmark and surrounding countries. The virus spreads through rain and kills people, so individuals avoid going outside during rainy weather.",
          "part_seven_text": " Through their determination and bravery, they eventually made significant progress towards stopping the virus and rebuilding the world.",
          "part_six_text": "They contacted scientists to find a solution to stop the virus. During this process, they faced many conflicts and fought both the virus and other surviving groups.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b3.3.svg?alt=media&token=f0374859-41c4-4ecf-a84b-48a2220a9fda",
          "part_three_text": "When they stepped outside, the scene they encountered was both terrifying and chaotic. Cities were in ruins, nature had overtaken everything, and the surviving people had organized into gangs. While trying to survive by avoiding the rain, Sophie and James faced numerous dangers. However, they managed to support each other.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b3.2.svg?alt=media&token=5e70659c-2103-405a-8efa-cccfd8924684",
          "part_two_text": "Two siblings, Sophie and James, were taken to a shelter by their father when they were very young, and they stayed there for six years. Their father had planned to return to the shelter to find a solution to the virus, but when he didn’t come back for a long time, they realized staying in the shelter was becoming dangerous. They decided to venture outside.",
          "title": "The Rain"
        },
        "id": 2,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/b3.1.svg?alt=media&token=11a5a0d4-3de0-4474-a66f-100c9c991df0",
        "title": "The Rain"
      }
    ],
    "dram": [
      {
        "details": {
          "part_eight_text": "",
          "part_five_text": "",
          "part_four_text": "That night, Jack passes away, but he leaves Emily with unforgettable memories and the importance of living life fully. To honor Jack's memory, Emily decides to fulfill his dreams and starts studying medicine at university. Jack's legacy lives on in Emily's life and heart forever.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d1.1.svg?alt=media&token=eebe3f7d-c92a-46ee-9526-7b0f85a3b695",
          "part_one_text": "Emily, a high school senior, has spent her life battling a chronic illness. Because of her condition, her life is limited and monotonous. However, one day she attends a support group and meets Jack, who is also ill. Jack is a lively, energetic, and positive young man.",
          "part_seven_text": "",
          "part_six_text": "",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d1.3.svg?alt=media&token=dc914d60-8739-4b55-a2ab-6d786788d558",
          "part_three_text": "One day, Jack's condition worsens, and he is hospitalized. Emily stays by his side, trying to lift his spirits. Jack's final wish is to watch the stars together. With all her strength, Emily takes Jack out of the hospital to fulfill his wish, and they spend a night under the stars.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d1.2.svg?alt=media&token=65f6b0d0-22a7-470c-bb5c-25203df37615",
          "part_two_text": "Emily and Jack quickly become close friends. Jack changes Emily's perspective on life and teaches her to live each moment to the fullest. Together, they embark on small but meaningful adventures. They explore the streets of Istanbul, watch the stars on the beach, and share their dreams.",
          "title": "Under the Stars"
        },
        "id": 3,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d1.1.svg?alt=media&token=eebe3f7d-c92a-46ee-9526-7b0f85a3b695",
        "title": "Under the Stars"
      },
      {
        "details": {
          "part_eight_text": "Lila’s story is an inspiring tale that shows how a loving family environment and proper support can nurture strong and successful individuals. Farm life provided Lila not just a home but also an opportunity to find herself and look to the future with hope. \"Life on the Farm\" remains a touching story that illustrates that nothing is impossible and that love can heal every wound.",
          "part_five_text": "One day, Lila learned that an old friend from the orphanage had moved to the town, which caused her emotional turmoil. Her old friend reminded her of the tough days they had experienced at the orphanage but also witnessed how Lila had become a strong and independent individual. This encounter helped Lila face her past and leave that period behind. She supported her old friend and helped them adjust to their new life.",
          "part_four_text": "At school, however, Lila faced some challenges. The other children found her background from the orphanage strange and began to tease her. But Lila had classmates Emma and Thomas by her side. These two children saw the goodness and courage within Lila. Thanks to them, Lila started adjusting to school and became close friends with Emma and Thomas. The three of them played games and had many adventures together.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d2.1.svg?alt=media&token=7c4a7c3d-c71f-41ac-b41b-634176ef87f4",
          "part_one_text": "At the age of five, Lila was placed in an orphanage after her parents tragically died in an accident. Despite her young age, Lila was always a strong and curious child. One day, an elderly couple, Anna and Peter, who had lost their own children and were now alone on their farm, decided to adopt Lila. This offered Lila a hopeful chance for a new beginning.",
          "part_seven_text": "Lila’s sweet and curious five-year-old self gradually evolved into a mature young woman. The values imparted by farm life and her family’s love helped her become a strong and determined individual. She continued her life as a young person with hope for the future, having healed the wounds of the past. Anna and Peter watched her growth with pride and supported her through every stage of her life.",
          "part_six_text": "As Lila grew, farm life became not just a place to live but also a place for development and learning. The farm work offered her opportunities to develop responsibility and leadership skills. She became a successful student at school, formed strong bonds with her friends, and skillfully handled the farm tasks.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d2.3.svg?alt=media&token=43d52fbd-ff62-4eb5-aa70-49ebbe453b79",
          "part_three_text": "As Lila began working on the farm, feeding the chickens, spending time in the garden, and caring for the dairy cows became a great source of excitement for her. Anna and Peter were delighted to see how well she embraced and performed her new duties. Lila slowly began to discover her own strength and abilities, finding peace and confidence in being close to nature.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d2.2.svg?alt=media&token=4265d960-9aee-40e1-97b4-16aaf48c7f6b",
          "part_two_text": "Lila arrived at her new home with great excitement and a bit of fear. The farm seemed large and unfamiliar to her. Anna and Peter began doing everything they could to light up the darkness within Lila and provide her with a loving home. At first, Lila struggled to adjust to the vast areas of the farm, but over time, she started connecting with the natural beauty and animals around her.",
          "title": "Life on the Farm"
        },
        "id": 4,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d2.1.svg?alt=media&token=7c4a7c3d-c71f-41ac-b41b-634176ef87f4",
        "title": "Life on the Farm"
      },
      {
        "details": {
          "part_eight_text": "In the end, Jack won the Moscow tournament and achieved a great victory.",
          "part_five_text": "As a young player, Jack began participating in international chess tournaments. Each victory brought him fame but also forced him to confront his personal problems.",
          "part_four_text": "When he left the orphanage, he was adopted by a family who recognized his chess skills and supported him. However, his inner struggles soon emerged. His achievements in chess were overshadowed by his personal issues.",
          "part_nine_text": "This triumph marked a new beginning for him, both in the chess world and in his personal life. He found balance and rediscovered himself. He realized the true value of himself and his talent.",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d3.1.svg?alt=media&token=931f64a8-2bae-4b14-964f-dee4ccabfd12",
          "part_one_text": "Once upon a time, in a small Pennsylvania town in the 1950s, lived a young orphan named Jack Harper. After a tragic accident that claimed his mother’s life, Jack was left alone and placed in an orphanage. During his time in the orphanage, he struggled to find himself amidst loneliness and loss.",
          "part_seven_text": "During the tournament, Jack managed to make strategic moves on the chessboard while battling his past traumas and addictions. Each move determined how he would progress not only in the chess game but also in his own life.",
          "part_six_text": "The competition and strategy in the chess world held significant importance in his life. A major tournament held in Moscow became a real test for him. In this tournament, Jack faced Ivan Petrov, a world-renowned rival. He was challenged not only in chess but also in his personal life.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d3.3.svg?alt=media&token=ef685b28-7d2a-485b-9a48-8e4cab88dda9",
          "part_three_text": "Under Mr. Collins’ guidance, Jack found himself in the world of chess. The game provided him with both an escape and a sense of purpose.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d3.2.svg?alt=media&token=6edbad4c-5574-4554-a5c1-09c6ba5c56bb",
          "part_two_text": "One day, in the dark basement of the orphanage, he encountered Mr. Collins, the janitor. Mr. Collins was a man who loved solving chess puzzles, and he noticed Jack’s talent.",
          "title": "The Royal Gambit"
        },
        "id": 5,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d3.1.svg?alt=media&token=931f64a8-2bae-4b14-964f-dee4ccabfd12",
        "title": "The Royal Gambit"
      },
      {
        "details": {
          "part_eight_text": "After the theater night, many families in the village decide to send their daughters to school. David begins to see more and more girls in his classroom. The girls share the importance of education and going to school with their families and surroundings. David takes pride in seeing that he has changed the educational perspective in the village and touched the lives of the girls.",
          "part_five_text": "David’s efforts gradually begin to bear fruit. A few families agree to send their daughters to school. At first, only a few girls come to the classroom, but this is a huge success for David. These girls become role models for other children and share the excitement of reading and writing.",
          "part_four_text": "To create awareness in the village, David decides to organize various activities. He holds educational seminars in the village square, opens literacy courses, and starts public relations activities. He pays special attention to the boys and mothers in the village, explaining to them the value of education.",
          "part_nine_text": "As a result of David’s several years of struggle in the village, most of the girls in the village now attend school. David’s determination and efforts have fundamentally changed the village’s understanding of education. The girls make the most of the opportunities presented to them, and the literacy rate in the village rapidly increases. When David leaves the village, he leaves behind a future full of hope.",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d4.1.svg?alt=media&token=687bdf08-5f37-4712-8c79-ed101a2a80f6",
          "part_one_text": "David is a young and idealistic teacher. After receiving his education in the big city, he is assigned to a remote mountain village. In this village, educating girls is not looked upon favorably.",
          "part_seven_text": "The entire village is invited to the theater night held in the village square. The girls perform the play they have prepared with great excitement and care. The performance deeply moves the villagers. The talent and confidence the girls display on stage open the eyes of the families. They realize what their daughters can achieve and how education can open doors for them.",
          "part_six_text": "As the girls succeed in school and due to David’s efforts, a big event is organized in the village. Under David’s guidance, the girls prepare a play. This play tells the history and culture of the village while emphasizing the importance of education.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d4.3.svg?alt=media&token=df983f89-031b-425c-b4db-d68f4fe2dfa4",
          "part_three_text": "David tries to explain to the villagers the importance of educating girls. He visits families and has long conversations with them. However, the resistance he faces is beyond his expectations. The girls want to go to school, but they are helpless as their families do not allow it.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d4.2.svg?alt=media&token=6d3da6ca-2151-4025-8cdd-0863e6eb7309",
          "part_two_text": "When David first arrives in the village, he starts his work with great enthusiasm and energy. However, he soon realizes that the girls in the village do not attend school. The village elders argue that girls do not need an education; they should stay at home and take care of household chores.",
          "title": "Seeds of Hope"
        },
        "id": 6,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d4.1.svg?alt=media&token=687bdf08-5f37-4712-8c79-ed101a2a80f6",
        "title": "Seeds of Hope"
      },
      {
        "details": {
          "part_eight_text": "And so, the tale of the stormy night became a cherished memory for Ella and Princess, a reminder of how a single act of kindness can transform lives and forge lifelong friendships.",
          "part_five_text": "Once inside, Ella wrapped Princess in a soft, warm blanket and set her down by the crackling fire. Princess's fur slowly dried, and she purred contentedly as Ella lovingly stroked her. Ella's parents, touched by the scene, offered Princess a bowl of warm milk, which she eagerly lapped up.",
          "part_four_text": "Ella’s heart raced as she finally reached Princess, who was shivering uncontrollably. With gentle hands, Ella scooped the soaked cat into her arms, shielding her from the relentless rain with the umbrella. They both trudged back through the storm, Ella’s shoes squelching in the puddles.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d5.1.svg?alt=media&token=412e1a90-baf8-45d1-a1c0-4bd2d54dc280",
          "part_one_text": "In a small, quaint town, a fierce storm raged on one fateful night. Winds howled with a menacing force, and rain battered every surface. While everyone huddled safely indoors, a small, white cat named Princess found herself alone and struggling in the tempest.",
          "part_seven_text": "By morning, the storm had passed, and the sun’s golden rays pierced through the clouds. Princess awoke in the comfort of Ella’s home, her fears replaced by a newfound sense of security. Ella and Princess became inseparable friends, embarking on daily adventures and sharing countless moments of joy.",
          "part_six_text": "As the storm raged on outside, Ella sat beside Princess, who eventually drifted into a peaceful sleep on Ella’s lap. Ella felt a deep sense of fulfillment, knowing she had made a difference in Princess’s life.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d5.3.svg?alt=media&token=14c6c8a0-7648-4084-b817-066e419794df",
          "part_three_text": "From the safety of her cozy bedroom window, a young girl named Ella noticed the forlorn cat. Ella’s heart ached for the poor creature braving the storm alone. Determined to help, she threw on her raincoat, grabbed an umbrella, and dashed outside into the torrential downpour.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d5.2.svg?alt=media&token=e62954cf-6190-4896-b5ee-539353f8e93f",
          "part_two_text": "As the storm grew more violent, Princess wandered the streets, her fur drenched and her tiny paws sinking into the muddy ground. She meowed plaintively, searching desperately for shelter.",
          "title": "The Stormy Night"
        },
        "id": 7,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/d5.1.svg?alt=media&token=412e1a90-baf8-45d1-a1c0-4bd2d54dc280",
        "title": "The Stormy Night"
      }
    ],
    "fantastic": [
      null,
      {
        "details": {
          "part_eight_text": "In the end, Elena and Lucas found solace in the 'Hidden Lake', a mystical place deep within the town that enhanced vampires' powers. Lucas decided to use this power to stay by Elena's side and protect her.",
          "part_five_text": "Gathering her courage, Elena directly asked Lucas about his secret. Lucas finally revealed the truth: he was a vampire who had been alive for centuries. He had moved to the town to hide from other vampires. Instead of feeding on human blood, Lucas sustained himself on animal blood and tried hard not to harm anyone.",
          "part_four_text": "One evening, while Elena was walking in the forest, she encountered a pack of wolves. Just as the wolves were about to attack, Lucas suddenly appeared and drove them away. Elena saw Lucas move with extraordinary speed and stop the wolves with just a glance. This incident made Elena realize that Lucas was no ordinary person.",
          "part_nine_text": "Despite all the challenges, Elena and Lucas's love grew stronger. The Hidden Lake became their sanctuary and a symbol of their love. Although the townspeople never learned Lucas's secret, they felt his devotion and love for Elena. Together, Elena and Lucas overcame hardships, rebuilding their love and their lives.",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f1.1.svg?alt=media&token=4da5f778-0273-40d8-be45-db2bc743d52a",
          "part_one_text": "The small town of Moonridge was known for its dense forests and misty lakes. Elena, a typical high school student, lived on the outskirts of this town. However, her life was about to change completely with the arrival of a mysterious and captivating young man named Lucas.",
          "part_seven_text": "However, Lucas's past would not leave him alone. Another group of vampires found Lucas in Moonridge and wanted to drive him away from the town. Elena and Lucas faced this threat together. Elena's bravery and Lucas's strength protected them from this danger.",
          "part_six_text": "Instead of being frightened upon learning Lucas was a vampire, Elena felt even closer to him. She understood Lucas's loneliness and inner conflict. The two fell in love, and this love changed both their lives.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f1.3.svg?alt=media&token=55c0c62e-b273-4ffc-8165-2bcf77547b82",
          "part_three_text": "One day, Elena and Lucas encountered each other in the school library. Elena noticed Lucas examining an old mythology book and approached him with curiosity. Instead of answering her questions, Lucas mysteriously walked away, increasing Elena's curiosity about him even more.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f1.2.svg?alt=media&token=53a3df9d-5616-4c31-8bc3-b2c01a131880",
          "part_two_text": "Shortly after moving to town, Lucas started attending the local school. He was quiet and reserved in class, but he immediately caught Elena's attention. Lucas had pale skin and deep, secretive eyes. As Elena got to know Lucas, she felt an undeniable attraction towards him.",
          "title": "Secrets of the Hidden Lake"
        },
        "id": 8,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f1.1.svg?alt=media&token=4da5f778-0273-40d8-be45-db2bc743d52a",
        "title": "Secrets of the Hidden Lake"
      },
      {
        "details": {
          "part_eight_text": "",
          "part_five_text": "Lily’s adventures are filled with her courage, intelligence, and friendships. The wizarding school is remembered as the place where Lily’s journey of growth and self-discovery began.",
          "part_four_text": "With the spells she learned at school and her courage, Lily confronts and defeats the dark forces. Together with Jack, she hides the artifact in a safe place and protects the school. Lily is now known as the hero of the school and earns great respect in the wizarding world.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f2.1.svg?alt=media&token=09501e25-07e9-4661-b025-229dbabe9392",
          "part_one_text": "Lily is a young girl living an ordinary life. One day, she learns a big secret her family has been hiding: she comes from an ancient line of wizards and has magical abilities. Lily is accepted into a secret wizarding school to discover and develop these abilities.",
          "part_seven_text": "",
          "part_six_text": "",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f2.3.svg?alt=media&token=2c1b0c91-b7c7-4e89-9ee3-aefee0b964a2",
          "part_three_text": "During their investigation, Lily and Jack discover an ancient and powerful magical artifact hidden in the depths of the school. This artifact holds great power that could allow dark forces to seize control. Lily and Jack embark on a great struggle to protect this artifact and prevent it from falling into the hands of the dark forces.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f2.2.svg?alt=media&token=7038fd12-c32f-4cc0-ab0a-e74cdac326bc",
          "part_two_text": "At the wizarding school, Lily learns various spells and makes new friends. However, rumors of dark forces rising again circulate through the school. Lily, along with a brave and intelligent boy named Jack, begins to investigate these dark forces.",
          "title": "School of Wizards"
        },
        "id": 9,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f2.1.svg?alt=media&token=09501e25-07e9-4661-b025-229dbabe9392",
        "title": "School of Wizards"
      },
      {
        "details": {
          "part_eight_text": "",
          "part_five_text": "Emily and her siblings fight against the dark forces using the keys. During this time, they learn that their grandfather was also a user of the keys in the past and had fought the same dark forces. Following the clues left by their grandfather, they discover the true power and purpose of the keys.",
          "part_four_text": "The siblings embark on a great struggle to protect the keys and prevent them from falling into the hands of these dark forces. In this struggle, each key holds a different secret and power. For instance, one key allows the user to control time, while another grants invisibility.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f3.1.svg?alt=media&token=4ff5b186-5ae7-46bb-b913-168d11fb44e1",
          "part_one_text": "In a quiet village far from the hustle and bustle of London, there stands an old and grand mansion. The new owners of the mansion, Emily and her siblings, Ethan and Daisy, move into this inheritance from their grandfather. From the moment they step into the mansion, they are enchanted by its atmosphere. However, the dark secrets of the mansion also await them.",
          "part_seven_text": "Emily and her siblings take on a new mission to protect this magical world and the keys. This adventure makes them the guardians not only of the mansion but of the entire world.",
          "part_six_text": "In the end, Emily and her siblings gather all the keys and confront the leader of the dark forces. After a great battle, they manage to defeat the dark forces and unveil the true purpose of the keys. The keys are not just magical powers but elements that maintain the balance of the universe.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f3.3.svg?alt=media&token=aacbfcf9-30bf-4cd7-bfbd-8162f58957a0",
          "part_three_text": "In this world, there are various keys with different powers. Each key grants its user special abilities. As Emily and her siblings spend more time in this world, they uncover the power and importance of the keys. However, they are not alone in this magical realm. Dark forces are also after the keys.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f3.2.svg?alt=media&token=ac70044c-c980-40c7-9ebe-b7c191eae11c",
          "part_two_text": "One day, Emily finds a key in the mansion’s library. The key catches her attention with its strange symbols. Driven by curiosity, she begins to investigate with her siblings to find out where the key belongs. They discover a hidden door in the basement and use the key to unlock it. Beyond the door, they are greeted by a magical and mysterious world.",
          "title": "The Secret of the Keys"
        },
        "id": 10,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f3.1.svg?alt=media&token=4ff5b186-5ae7-46bb-b913-168d11fb44e1",
        "title": "The Secret of the Keys"
      },
      {
        "details": {
          "part_eight_text": "",
          "part_five_text": "With Max’s help, the group learns how to fight the creatures and close the door to the World of Shadows. They face a fierce battle and finally return to the lab. However, the leader of the creatures, a terrifying monster, is on the verge of crossing into the town.",
          "part_four_text": "Alex, Mia, Jack, and Emma must find a way to prevent these creatures from crossing into their town. During their quest, they encounter another child, Max, who had been lost in this world. Max has survived in the World of Shadows and learned how to deal with the creatures.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f4.1.svg?alt=media&token=4e5cbc11-7efb-403f-8466-0db0a3807d54",
          "part_one_text": "In the small town of Maplewood, four friends - Alex, Mia, Jack, and Emma - set off on a summer adventure, riding their bikes into the depths of an old forest. Deep within the forest, they stumble upon an abandoned and mysterious laboratory. Driven by curiosity, they enter and find documents and devices indicating strange experiments were conducted there.",
          "part_seven_text": "",
          "part_six_text": "At the last moment, Alex, Mia, Jack, Emma, and Max destroy the lab’s power source, sealing the door and preventing the creatures from passing through. When they return to Maplewood, the marks of their adventure have changed them forever. Yet, they know the danger from the World of Shadows is not completely gone, and the secrets of the town are still waiting to be uncovered.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f4.3.svg?alt=media&token=ddb4007b-c8d2-4094-8c6f-883aa3512a79",
          "part_three_text": "As they venture through the World of Shadows, they uncover horrific secrets about the town's past. They learn that the old laboratory was actually a dark experiment center where monstrous creatures were created. These creatures now rule the World of Shadows and are trying to escape.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f4.2.svg?alt=media&token=c41381bb-dd2e-4f16-8e09-e4611f94db74",
          "part_two_text": "In the lab, Alex accidentally touches a button, causing power outages throughout the town. Simultaneously, a door deep within the lab opens, leading to a dark and dangerous parallel universe known as the World of Shadows. In this world, terrifying creatures and bizarre events await them.",
          "title": "The World of Shadows"
        },
        "id": 11,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f4.1.svg?alt=media&token=4e5cbc11-7efb-403f-8466-0db0a3807d54",
        "title": "The World of Shadows"
      },
      {
        "details": {
          "part_eight_text": "",
          "part_five_text": "In the forest’s depths, Selin encounters the source of the curse, the Dark Lord. The Dark Lord’s power permeates every corner of the forest, making it challenging to confront him. The Dark Lord presents a significant threat to Selin and controls the dark shadows over the forest.",
          "part_four_text": "She protects herself using the Shield of Light spell. The shield creates a protective light area against the dark spirits' attacks. This light reduces the spirits’ shadowy influence and ensures Selin’s safety. She moves quickly to maintain the shield’s power and manages to escape from the temple.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f5.1.svg?alt=media&token=a4681345-13cf-4b22-9d8b-802266db22a0",
          "part_one_text": "In a town with a medieval atmosphere, a young warrior named Selin finds herself deep within a dark forest. This forest has been under a curse for years, and the creatures that live here pose a great threat to the townsfolk. According to an ancient legend, Selin is the only one who can lift this curse.",
          "part_seven_text": "With the help of her spells, Selin defeats the Dark Lord and restores the forest to its former state. By ensuring the freedom of the forest and the town, she also comes to understand the dangers of magical power and ancient secrets. She dedicates herself to maintaining balance in this world.",
          "part_six_text": "Selin draws her Shadow Sword and battles the Dark Lord’s dark minions. The sword conceals her enemies in shadows, allowing her to neutralize them one by one. As Selin uses the sword, she causes the creatures to disappear into the shadows and strategically positions herself behind the enemies.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f5.3.svg?alt=media&token=451dcfd1-c02d-43a1-b554-d1cb63dad03e",
          "part_three_text": "While continuing through the forest, Selin discovers an abandoned temple. Inside the temple, she finds ancient magical artifacts and texts that can enhance her magical powers. The temple is filled with a heavy darkness and an eerie silence. Suddenly, Selin is attacked by a group of dark spirits trapped within the temple.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f5.2.svg?alt=media&token=331ed501-539f-46bd-8991-aca56e3f6907",
          "part_two_text": "Selin embarks on a dangerous journey through the forest’s depths. As she navigates the foggy and shadowy regions, she encounters eerie whispers and moving shadows. She is surrounded by a group of cursed creatures. To resolve the situation, Selin uses the Wind's Speed spell. This spell allows Selin to move swiftly and temporarily outpaces the creatures.",
          "title": "The Curse of the Dark Forest"
        },
        "id": 12,
        "isFavorite": false,
        "level": "B1",
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f5.1.svg?alt=media&token=a4681345-13cf-4b22-9d8b-802266db22a0",
        "title": "The Curse of the Dark Forest"
      },
      {
        "details": {
          "part_eight_text": "Emily and the children improve their survival skills in their new location. They form a silent community and begin to live together with other survivors. This new order, where everyone's contribution is valued, is based on silence and mutual support. The Parker family finds new hope thanks to Jack's sacrifice and continues to survive in the silent world.",
          "part_five_text": "Emily's labor pains begin, and she is left alone at home while Jack is dealing with the children. Emily tries various methods to suppress the sounds during childbirth and struggles greatly. Finally, the baby is born, but its cries pose a significant threat. Emily must find a way to keep the baby quiet.",
          "part_four_text": "While searching for food in the forest, Luke and Olivia accidentally make a sound. This draws the monsters' attention, and they begin to follow them. The children are in great danger as they try to escape silently. Jack moves to rescue his children and faces the monsters.",
          "part_nine_text": "",
          "part_one_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f6.1.svg?alt=media&token=7c974b45-ddee-4f12-b411-574cf962c89f",
          "part_one_text": "In a future where invisible monsters have invaded the world, everything has changed. The monsters are sensitive to sound and can find and destroy their prey with the slightest noise. Humans have had to learn to live in silence to survive. The Parker family is one such family struggling to survive in this silent world.",
          "part_seven_text": "Thanks to Jack's sacrifice, Emily reaches a safe place with the children and the newborn baby. The family continues to live silently, honoring Jack's memory and drawing strength from his courage to continue their struggle for survival. The Parker family succeeds in surviving in the silent world and looks to the future with new hope.",
          "part_six_text": "Jack returns home with the children and learns that Emily has given birth. The family makes a plan to prevent the monsters from coming to the house. Jack decides to sacrifice himself to distract the monsters. While Emily fights to take Luke, Olivia, and the newborn baby to safety, Jack confronts the monsters.",
          "part_three_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f6.3.svg?alt=media&token=ed23138f-725f-4a55-85ad-4b8f31487240",
          "part_three_text": "One day, Emily discovers she is pregnant again. This poses a significant danger in a world where silence is mandatory. Jack and Emily start planning for a silent birth and ways to keep the baby quiet. They meticulously prepare, making sure no noise is made.",
          "part_two_image": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f6.2.svg?alt=media&token=2f7ac083-acdc-4868-90b6-2a0196766cd4",
          "part_two_text": "The Parker family had learned to live in this silent world. Father Jack, mother Emily, and their children, Luke and young Olivia, had learned to survive thanks to their strong bond. In their daily lives, they were careful not to make any noise. They wore quiet slippers, communicated with sign language, and sprinkled sand on their paths to muffle their footsteps.",
          "title": "Silent Hill"
        },
        "id": 13,
        "isFavorite": false,
        "picUrl": "https://firebasestorage.googleapis.com/v0/b/englishstoriesapp-6b27c.appspot.com/o/f6.1.svg?alt=media&token=7c974b45-ddee-4f12-b411-574cf962c89f",
        "title": "Silent Hill"
      }
    ]
  }
}
